# Empty Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId..::..Empty Method
ForgeTypeId Class See Also
---
Checks if the typeId is an empty string
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool Empty()
```

Visual Basic
---
```text
Public Function Empty As Boolean
```

Visual C++
---
```text
public:
bool Empty()
```

# See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace